results/test_case_2.txt
bin/ycsb run scylla -s -P workloads/workloada \
    -target 1000 -threads 100 -p recordcount=600000000 \
    -p insertstart=0 -p insertcount=200000000 \
    -p fieldcount=10 -p fieldlength=100 \
    -p operationcount=5000000 \
    -p readallfields=true \
    -p writeallfields=false \
    -p requestdistribution=zipfian \
    -p fieldlengthdistribution=constant \
    -p readproportion=0.5 \
    -p updateproportion=0.25 \
    -p insertproportion=0.25 \
    -p scylla.username=cassandra -p scylla.password=cassandra \
    -p scylla.hosts=scylla-cluster-client.scylla.svc

bin/ycsb run scylla -s -P workloads/workloada \
    -target 1000 -threads 100 -p recordcount=600000000 \
    -p insertstart=200000000 -p insertcount=200000000 \
    -p fieldcount=10 -p fieldlength=100 \
    -p operationcount=5000000 \
    -p readallfields=true \
    -p writeallfields=false \
    -p requestdistribution=zipfian \
    -p fieldlengthdistribution=constant \
    -p readproportion=0.5 \
    -p updateproportion=0.25 \
    -p insertproportion=0.25 \
    -p scylla.username=cassandra -p scylla.password=cassandra \
    -p scylla.hosts=scylla-cluster-client.scylla.svc

bin/ycsb run scylla -s -P workloads/workloada \
    -target 1000 -threads 100 -p recordcount=600000000 \
    -p insertstart=400000000 -p insertcount=200000000 \
    -p fieldcount=10 -p fieldlength=100 \
    -p operationcount=5000000 \
    -p readallfields=true \
    -p writeallfields=false \
    -p requestdistribution=zipfian \
    -p fieldlengthdistribution=constant \
    -p readproportion=0.5 \
    -p updateproportion=0.25 \
    -p insertproportion=0.25 \
    -p scylla.username=cassandra -p scylla.password=cassandra \
    -p scylla.hosts=scylla-cluster-client.scylla.svc


[OVERALL], RunTime(ms), 5003283
[OVERALL], Throughput(ops/sec), 999.34383084067
[TOTAL_GCS_G1_Young_Generation], Count, 221
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 511
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.010213293951191646
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 221
[TOTAL_GC_TIME], Time(ms), 511
[TOTAL_GC_TIME_%], Time(%), 0.010213293951191646
[READ], Operations, 1893295
[READ], AverageLatency(us), 1256.5806353473706
[READ], MinLatency(us), 392
[READ], MaxLatency(us), 33695
[READ], 95thPercentileLatency(us), 2659
[READ], 99thPercentileLatency(us), 3577
[READ], Return=OK, 1893295
[READ], Return=NOT_FOUND, 607582
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 22192.79
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2220031
[CLEANUP], 95thPercentileLatency(us), 7
[CLEANUP], 99thPercentileLatency(us), 17
[INSERT], Operations, 1248668
[INSERT], AverageLatency(us), 921.2956958935441
[INSERT], MinLatency(us), 397
[INSERT], MaxLatency(us), 38527
[INSERT], 95thPercentileLatency(us), 1880
[INSERT], 99thPercentileLatency(us), 2461
[INSERT], Return=OK, 1248668
[READ-FAILED], Operations, 607582
[READ-FAILED], AverageLatency(us), 1009.9105157822319
[READ-FAILED], MinLatency(us), 367
[READ-FAILED], MaxLatency(us), 42751
[READ-FAILED], 95thPercentileLatency(us), 2211
[READ-FAILED], 99thPercentileLatency(us), 2885
[UPDATE], Operations, 1250455
[UPDATE], AverageLatency(us), 876.946817758336
[UPDATE], MinLatency(us), 347
[UPDATE], MaxLatency(us), 49695
[UPDATE], 95thPercentileLatency(us), 1828
[UPDATE], 99thPercentileLatency(us), 2413
[UPDATE], Return=OK, 1250455